In [2]:
import pandas as pd 
import numpy as np
import tables
import clean_jor
import metrics_jor

In [3]:
pd.set_option("display.max_columns",None)
pd.set_option('display.max_rows', 10)

# 1. Get tables and clean

In the 8a.nu Database we have 3 different tables: 
- User : with all the user information
- Ascent: the user can record his/her ascention and grade it
- Conversion: the grade conversion for different countries

<b>GET USER-ASCENT-CONVERSION TABLES

In [4]:
conversion = tables.conversion_table()
user = tables.user_table()
ascent = tables.ascent_table()

In [5]:
user.head(2)

,user_id,first_name,last_name,city,country,sex,height,weight,started,competitions,occupation,sponsor1,sponsor2,sponsor3,best_area,worst_area,guide_area,interests,birth,presentation,deactivated,anonymous
0,1,first,last,Göteborg,SWE,0,177,73,1996,NaN,NaN,NaN,NaN,NaN,"Railay beach, Krabi, Thailand",NaN,NaN,NaN,1976-03-10,NaN,0,0
1,2,first,last,stockholm,SWE,0,0,0,2000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0

<b>CLEAN USER-ASCENT TABLES

In [6]:
user_clean = tables.clean_user(user)

Before cleaning the table
(62593, 22)


After cleaning the table
(17544, 7)

In [7]:
user_clean.head(4)

        country  sex  height  weight   age  years_cl
user_id
1           SWE    0     177      73  41.0        21
3           SWE    0     180      78  44.0        22
4           SWE    1     165      58  33.0        16
6           AUS    0     185      73  47.0        25

In [8]:
ascent_clean = tables.clean_ascent(ascent)

Before cleaning the table
(4111877, 28)
(2875675, 14)
(2826372, 14)


After cleaning the table
(1684457, 15)

In [9]:
ascent_clean.head(3)

,user_id,grade_id,method_id,date,year,rec_date,name,crag_id,sector_id,country,comment,rating,user_recommended,first_ascent,second_go
0,1,36,3,1999-02-06 23:00:00,1999,2005-01-30 23:00:00,the king and i,16596,61,tha,thailand\n,0,0,0,0
1,1,36,3,1999-07-26 22:00:00,1999,2005-01-30 23:00:00,mr big,209,371,swe,\n,0,0,0,0
2,1,36,3,1999-07-26 22:00:00,1999,2005-01-30 23:00:00,tak ska du ha,209,371,swe,\n,0,0,0,0

In [10]:
ascent_clean.shape

(1684457, 15)

<b> GET GRADES TABLE

The grades table shows different grade information for each user, it is derivated from the ascent table

In [11]:
grades = tables.grades_table(ascent_clean)

In [12]:
grades.head(2)

,user_id,date_first,date_last,grades_count,grades_first,grades_last,grades_max,grades_mean,year_first,year_last
0,1,1999-02-06 23:00:00,2001-07-31 22:00:00,84,36,55,62,46.750000,1999,2001
1,3,1999-03-31 22:00:00,2000-07-19 22:00:00,12,53,51,59,52.833333,1999,2000

In [13]:
grades.shape

(25767, 10)

<b> GET CLIMBER TABLE

We concatenate user and grades table to get the main table

In [14]:
grades = grades.set_index("user_id")
climber_df = pd.concat([user_clean,grades],axis=1,join='inner')
climber_df.to_csv('../data/climber_df.csv')

In [15]:
climber_df.head(3)

,country,sex,height,weight,age,years_cl,date_first,date_last,grades_count,grades_first,grades_last,grades_max,grades_mean,year_first,year_last
user_id,,,,,,,,,,,,,,,
1,SWE,0,177,73,41.0,21,1999-02-06 23:00:00,2001-07-31 22:00:00,84,36,55,62,46.750000,1999,2001
3,SWE,0,180,78,44.0,22,1999-03-31 22:00:00,2000-07-19 22:00:00,12,53,51,59,52.833333,1999,2000
4,SWE,1,165,58,33.0,16,2004-06-30 22:00:00,2009-05-26 22:00:00,119,53,49,64,53.890756,2004,2009

<b> CLEAN CLIMBER TABLE

In [16]:
climber_clean = clean_jor.clean_climber(climber_df,conversion)

Before cleaning the table
(10927, 15)


After cleaning the table
(7719, 10)

In [17]:
climber_clean.head()

,country,sex,height,weight,age,years_cl,grades_max,grades_mean,year_last,max_fra
0,SWE,0,177,73,25.0,5,62,46.750000,2001,8a+/8b
1,SWE,0,180,78,27.0,5,59,52.833333,2000,8a
2,NOR,0,177,68,37.0,14,53,51.400000,2010,7b+
3,BEL,0,180,68,21.0,6,49,37.250000,2002,7a+
4,CAN,0,180,68,45.0,29,64,50.395349,2017,8b/+

<b> GET COUNTRY GRADES TABLE

This table will be used in tableau for analytical purposes

In [18]:
country = tables.country_table(climber_df, conversion)

## - Save dataframe -

In [19]:
ascent_clean.to_csv('../../databases/ascent_clean.csv')
country.to_csv('../data/country.csv')
climber_clean.to_csv('../data/climber_all_clean.csv')